In [1]:
import pandas as pd

In [7]:
df = pd.DataFrame({
    'nomor' : [1,2,3,4,5],
    'nik' : [111,222,33,444,555],
    'nama' : ['arip','anggi','adi','arsy','arsy']
})
df

   nomor  nik   nama
0      1  111   arip
1      2  222  anggi
2      3   33    adi
3      4  444   arsy
4      5  555   arsy

In [3]:
df.head(3)

   nomor  nik   nama
0      1  111   arip
1      2  222  anggi
2      3   33    adi

In [8]:
df['nama'].unique()

array(['arip', 'anggi', 'adi', 'arsy'], dtype=object)

In [9]:
df['nama'].nunique()

4

In [10]:
df['nama'].value_counts()

arsy     2
anggi    1
arip     1
adi      1
Name: nama, dtype: int64

In [11]:
df.sort_values(by='nama')

   nomor  nik   nama
2      3   33    adi
1      2  222  anggi
0      1  111   arip
3      4  444   arsy
4      5  555   arsy

In [12]:
df.sort_values(by='nik')

   nomor  nik   nama
2      3   33    adi
0      1  111   arip
1      2  222  anggi
3      4  444   arsy
4      5  555   arsy

In [13]:
data = {
    'jenis kelamin' : ['laki-laki','laki-laki','laki-laki','perempuan','perempuan','perempuan'],
    'usia' : ['tua','tua','muda','muda','tua','muda'],
    'menikah' : ['ya','tidak','tidak','ya','tidak','ya'],
    'peringkat' : [1,2,3,4,5,6]
}
df = pd.DataFrame(data)

In [14]:
df

  jenis kelamin  usia menikah  peringkat
0     laki-laki   tua      ya          1
1     laki-laki   tua   tidak          2
2     laki-laki  muda   tidak          3
3     perempuan  muda      ya          4
4     perempuan   tua   tidak          5
5     perempuan  muda      ya          6

In [15]:
df.pivot_table(values='peringkat', index=['jenis kelamin', 'usia'], columns=['menikah'])

menikah             tidak   ya
jenis kelamin usia
laki-laki     muda    3.0  NaN
              tua     2.0  1.0
perempuan     muda    NaN  5.0
              tua     5.0  NaN